In [66]:
import pandas as pd
import numpy as np

import datetime as dt

In [67]:
CFS = pd.read_csv('USGS_CFS.tsv', sep = '\t')

In [68]:
CFS.head()

  agency_cd   site_no          datetime tz_cd 211112_00060 211112_00060_cd
0        5s       15s               20d    6s          14n             10s
1      USGS  07094500  2017-06-08 00:00   MDT         3300               A
2      USGS  07094500  2017-06-08 00:15   MDT         3300               A
3      USGS  07094500  2017-06-08 00:30   MDT         3300               A
4      USGS  07094500  2017-06-08 00:45   MDT         3300               A

In [69]:
CFS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96058 entries, 0 to 96057
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   agency_cd        96058 non-null  object
 1   site_no          96058 non-null  object
 2   datetime         96058 non-null  object
 3   tz_cd            96058 non-null  object
 4   211112_00060     96058 non-null  object
 5   211112_00060_cd  96058 non-null  object
dtypes: object(6)
memory usage: 4.4+ MB

In [70]:
CFS = CFS.drop([0], axis = 0)

In [71]:
CFS.head(10)

   agency_cd   site_no          datetime tz_cd 211112_00060 211112_00060_cd
1       USGS  07094500  2017-06-08 00:00   MDT         3300               A
2       USGS  07094500  2017-06-08 00:15   MDT         3300               A
3       USGS  07094500  2017-06-08 00:30   MDT         3300               A
4       USGS  07094500  2017-06-08 00:45   MDT         3300               A
5       USGS  07094500  2017-06-08 01:00   MDT         3290               A
6       USGS  07094500  2017-06-08 01:15   MDT         3280               A
7       USGS  07094500  2017-06-08 01:30   MDT         3250               A
8       USGS  07094500  2017-06-08 01:45   MDT         3230               A
9       USGS  07094500  2017-06-08 02:00   MDT         3200               A
10      USGS  07094500  2017-06-08 02:15   MDT         3170               A

In [72]:
#Changing data types
CFS['datetime'] = pd.to_datetime(CFS['datetime'])

In [73]:
CFS['year'] = CFS['datetime'].dt.year

In [74]:
CFS['date'] = CFS['datetime'].dt.strftime('%m/%d/%Y')

In [85]:
CFS['date'] = pd.to_datetime(CFS['date'])

In [86]:
CFS = CFS.rename(columns = {'211112_00060' : 'cfs'})

In [101]:
CFS['cfs'] = CFS['cfs'].astype('int')

In [102]:
CFS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96057 entries, 1 to 96057
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   agency_cd        96057 non-null  object
 1   site_no          96057 non-null  object
 2   datetime         96057 non-null  datetime64[ns]
 3   tz_cd            96057 non-null  object
 4   cfs              96057 non-null  int32
 5   211112_00060_cd  96057 non-null  object
 6   year             96057 non-null  int64
 7   date             96057 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int32(1), int64(1), object(4)
memory usage: 5.5+ MB

In [104]:
CFS.describe()

                cfs          year
count  96057.000000  96057.000000
mean     995.497934   2019.640214
std      892.815094      1.621549
min      203.000000   2017.000000
25%      401.000000   2018.000000
50%      764.000000   2020.000000
75%     1180.000000   2021.000000
max     5670.000000   2022.000000

In [111]:
CFS_day = CFS[['date', 'cfs']].groupby(['date']).mean().reset_index()

In [117]:
CFS_day.head()

        date     cfs
0 2017-06-08  3425.0
1 2017-06-09  3645.0
2 2017-06-10  3711.0
3 2017-06-11  3769.0
4 2017-06-12  3709.0

In [116]:
CFS_day['cfs'] = CFS_day['cfs'].round(0)

In [120]:
CFS_day.to_csv('CFS_by_day.csv', index = 0)